export const hi = {
  Components: {
    Ads: {
      remove_ad: "विज्ञापन हटाएं",
    },
    GroupInvite: {
      participants: "प्रतिभागी",
      join: "शामिल हों",
    },
    FriendActionButtons: {
      title: "आपका मित्र बनना चाहता है",
      accept: "स्वीकार करें",
      reject: "अस्वीकार करें",
    },
    AddFriendButton: {
      friends: "मित्र",
      requested: "अनुरोध भेजा गया",
      request: "मित्र के रूप में जोड़ें",
    },
    Chat: {
      AudioPlayer: {},
      CurrentReplyingMessage: {
        file_amount_one: "फ़ाइल",
        file_amount_other: "फ़ाइलें",
        replying_text: "आप उत्तर दे रहे हैं:",
        voice_message: "वॉयस संदेश",
      },
      FilePreview: {
        alerts: {
          download: {
            title: "❗ बहुत सावधानी",
            content:
              "क्या आप वाकई फ़ाइल डाउनलोड करना चाहते हैं? दुर्भावनापूर्ण फ़ाइलें आपके फ़ोन को नुकसान पहुँचा सकती हैं!\n\n📁 फ़ाइल का नाम: {{name}}",
            ok_text: "डाउनलोड करें",
            cancel_text: "रद्द करें",
          },
        },
      },
      Message: {
        poll: "📊 पोल: {{question}}",
        toasts: {
          copied_message: "संदेश कॉपी किया गया",
        },
        alerts: {
          open_link: {
            title: "⚠ सावधानी, यह खतरनाक हो सकता है",
            content:
              "क्या आप वाकई इस लिंक को खोलना चाहते हैं? हम इसे एक्सेस करते समय आपकी सुरक्षा की गारंटी नहीं दे सकते।\n\n{{url}}",
            ok_text: "खोलें",
            cancel_text: "नहीं",
          },
        },
        options: {
          reply: "उत्तर दें",
          copy: "कॉपी करें",
          show_original_message: "मूल संदेश दिखाएं",
          translate_message: "संदेश का अनुवाद करें",
          original_restored: "मूल संदेश पुनर्स्थापित किया गया।",
          already_in_lang: "संदेश पहले से ही आपकी भाषा में है।",
          translated_success: "संदेश का अनुवाद किया गया!",
          not_identified_lang: "भाषा की पहचान नहीं की जा सकी।",
          part_opt: "प्रतिभागी विकल्प",
          delete: "हटाएं",
          report: "संदेश की रिपोर्ट करें",
        },
      },
      RecordingAudio: {
        recording: "रिकॉर्ड हो रहा है",
      },
      ReplyingMessage: {
        read_more: "और पढ़ें",
        read_less: "कम पढ़ें",
        replying: "उत्तर दे रहे हैं:",
        voice_message: "🎤 वॉयस संदेश",
        files_one: "फ़ाइल",
        files_other: "फ़ाइलें",
      },
      InviteInMessage: {
        invalid_invite_title: "🚫 अमान्य आमंत्रण",
        invalid_invite_subtitle:
          "आमंत्रण की समय सीमा समाप्त हो गई होगी, इसे हटा दिया गया होगा या यह उपयोग की अधिकतम सीमा तक पहुँच गया होगा!",
        invite_title: "आमंत्रण:",
        invite_screen_title: "आपको समूह में आमंत्रित किया गया है:",
        no_desc: "कोई विवरण नहीं",
        joined_text: "आप पहले ही शामिल हो चुके हैं!",
        join_text: "समूह में शामिल हों",
        toasts: {
          joined: "आप '{{name}}' समूह में शामिल हो गए हैं!",
          error: "आमंत्रण का उपयोग नहीं किया जा सका",
        },
      },
      LinkPreview: {
        watch_text: "देखने के लिए यहां टैप करें",
        link_copied: "लिंक कॉपी किया गया",
      },
      Typing: {
        typing_user_one: "टाइप कर रहा है",
        typing_user_other: "टाइप कर रहे हैं",
        typing: "टाइप करना",
        many: "कई उपयोगकर्ता",
      },
      Poll: {
        max_options: "अधिकतम {{count}} विकल्प तक पहुँच गए।",
        min_options: "पोल में कम से कम {{count}} विकल्प होने चाहिए।",
        type_poll_question: "पोल का प्रश्न दर्ज करें।",
        create_poll: "पोल बनाएं",
        options: "विकल्प",
        question_input_placeholder: "उदा: कार्यक्रम कहाँ है?",
        question_option_placeholder: "विकल्प {{count}}",
        add_option: "विकल्प जोड़ें",
        multiple: "बहु-विकल्प की अनुमति दें",
        question: "प्रश्न",
      },
    },
    Modals: {
      EmblemModal: {
        title: "शानदार बैッジ, है ना?",
        content:
          "यह उन बेहद खास लोगों को दिया जाता है जो स्टार प्लान के साथ Saturn Chat का समर्थन करते हैं।",
        premium_text:
          "क्या आप भी ऐसा चाहते हैं? तो आइए तारामंडल का हिस्सा बनें!",
        be_star: "स्टार प्राप्त करें",
      },
    },
    Alert: {
      cancel: "रद्द करें",
    },
  },
  OnBoarding: {
    done: "शुरू करें",
    skip: "छोड़ें",
    pages: {
      0: {
        title: "Saturn Chat में आपका स्वागत है!",
        subtitle:
          "यहाँ आपको विभिन्न प्रकार के समूह मिलेंगे (या आप अपनी पसंद का समूह बना सकते हैं)।",
      },
      1: {
        title: "आसानी से संदेश भेजें!",
        subtitle:
          "कुछ ही क्लिक में आप फ़ोटो, वीडियो और यहाँ तक कि वॉयस संदेशों के साथ संदेश भेज और प्राप्त कर सकते हैं।",
      },
      2: {
        title: "आप सुरक्षित हैं!",
        subtitle:
          "यहाँ आपकी गोपनीयता सुरक्षित है और आपका डेटा किसी को नहीं बेचा जाएगा!",
      },
      3: {
        title: "एक स्टार बनें!",
        subtitle:
          "जब आप तैयार हों, तो सेटिंग मेनू में जाएं, स्टार प्लान प्राप्त करें और Saturn Chat का पूरा आनंद लें!",
      },
    },
  },
  Auth: {
    Home: {
      title: "क्या हम शुरू करें?",
      subtitle: "ऐप का उपयोग शुरू करने के लिए लॉग इन करें या अपना खाता बनाएं!",
      login: "लॉग इन करें",
      new_account: "खाता बनाएं",
    },
    CreateAccount: {
      header_title: "खाता बनाएं",
      avatar_select_label: "प्रोफ़ाइल फ़ोटो चुनें",
      avatar_select_tip:
        "💡 अनुस्मारक: आपको अधिकतम 5 MB की छवि चुननी होगी।",
      avatar_selected: "🖼 यह फ़ोटो बिल्कुल सही है!",
      register_error:
        "खाता नहीं बनाया जा सका। संभवतः ईमेल पहले से उपयोग में है; लॉग इन करने का प्रयास करें।",
      internal_error: "एक आंतरिक सर्वर त्रुटि हुई। कृपया बाद में पुनः प्रयास करें।",
      nickname_rules:
        "यह एक अद्वितीय नाम होना चाहिए, जिसमें केवल संख्याएँ और अक्षर हों। केवल हाइफ़न (-) और अंडरस्कोर (_) उपलब्ध हैं। यदि कोई उपयोगकर्ता नाम प्रदान नहीं किया जाता है, तो आपके लिए स्वतः ही एक उत्पन्न किया जाएगा।",
      searching: "खोज रहा है...",
      labels: {
        name: "नाम",
        nickname: "उपयोगकर्ता नाम",
        email: {
          label: "ईमेल",
          error: "यह ईमेल अमान्य है",
        },
        password: {
          label: "पासवर्ड दर्ज करें",
          error: "पासवर्ड सुरक्षा मानकों को पूरा नहीं करता है",
          info: "आपके पासवर्ड में कम से कम 8 वर्ण होने चाहिए (कम से कम 1 बड़ा अक्षर सहित), कम से कम 1 संख्या और 1 प्रतीक होना चाहिए।",
        },
        password_again: {
          label: "अपना पासवर्ड पुष्टि करें",
          error: "पासवर्ड मेल नहीं खाते",
        },
      },
      register_button: "खाता बनाएं",
      consent: {
        guidelines: "समुदाय दिशानिर्देश",
        privacy_policy: "गोपनीयता नीति",
        line_0: '"खाता बनाएं" पर क्लिक करके आप हमारी',
        line_1: "और हमारी भी स्वीकार करते हैं",
      },
    },
    Login: {
      header_title: "लॉग इन करें",
      title: "नमस्ते,\nवापस स्वागत है",
      login_error:
        "लॉग इन नहीं किया जा सका। अपने विवरण की जाँच करें या खाता बनाएं।",
      email: "ईमेल",
      password: "पासवर्ड",
      forgot_password: "पासवर्ड भूल गए?",
      login_button: "प्रवेश करें",
      register_button: "यहाँ नए हैं? खाता बनाएं!",
      internal_error: "एक आंतरिक सर्वर त्रुटि हुई। कृपया बाद में पुनः प्रयास करें।",
    },
  },
  TabBar: {
    groups: "समूह",
    friends: "मित्र",
    new_group: "नया समूह",
    settings: "विकल्प",
  },
  Home: {
    header_title: "समूह",
    quick_access: "त्वरित पहुंच",
    empty_list: {
      title: "किसी समूह में शामिल होकर शुरुआत क्यों न करें?",
      search_text: "टैब पर जाएं",
      line_0: "और कुछ खोजें या हमारे में शामिल हों",
      official_group: "आधिकारिक समूह",
    },
    groups_list: {
      title: "समूहों तक पहुंचें",
      subtitle_one: "आप {{count}} समूह में हैं",
      subtitle_other: "आप {{count}} समूहों में हैं",
    },
  },
  Friends: {
    header_title: "मित्र",
    title: "प्रत्यक्ष संदेश",
    subtitle:
      "अपने मित्रों को निजी संदेश भेजें। आप केवल अपनी मित्रों की सूची के लोगों से बात कर सकते हैं।",
    empty_list_text: "आपका कोई मित्र नहीं है। नए मित्र जोड़ें।",
  },
  NewGroup: {
    header_title: "नया समूह",
    avatar_select_label: "प्रोफ़ाइल फ़ोटो चुनें",
    avatar_select_tip:
      "हम 600x600 पिक्सेल और अधिकतम 5 MB की छवि की अनुशंसा करते हैं",
    avatar_selected: "🖼 यह फ़ोटो बिल्कुल सही है!",
    limit: {
      title: "आप {{count}} समूहों की सीमा तक पहुँच गए हैं!",
      subtitle:
        "यह सीमा इसलिए निर्धारित की गई है ताकि हर कोई Saturn Chat पर अपने समुदाय बना सके और स्पैम जैसी समस्याओं से बचा जा सके.",
      premium:
        "आप एक स्टार भी बन सकते हैं और प्रत्येक में {{participants}} प्रतिभागियों के साथ अधिकतम {{groups}} समूह बना सकते हैं.",
    },
    form: {
      labels: {
        name: {
          label: "समूह का नाम",
          placeholder: "अधिकतम 100 वर्ण",
        },
        desc: {
          label: "अपने समूह का वर्णन करें",
          placeholder: "अधिकतम 500 वर्ण",
        },
        tags: {
          label: "समूह टैग",
          placeholder: "अल्पविराम से अलग करें",
        },
        public: "सार्वजनिक",
        private: "निजी",
      },
      create_group: "समूह बनाएं",
    },
    star: "स्टार बनें",
  },
  Settings: {
    header_title: "सेटिंग्स",
    alerts: {
      sign_out: {
        title: "😥 क्या आप वाकई बाहर निकलना चाहते हैं?",
        subtitle:
          "बाहर निकलने पर, आपको नए संदेशों, आमंत्रणों या किसी भी चीज़ की सूचना नहीं मिलेगी।",
        ok_text: "बाहर निकलें",
        cancel_text: "रद्द करें",
      },
    },
    general: {
      title: "सामान्य",
      star: "स्टार बनें",
      manage_star: "स्टार प्लान प्रबंधित करें",
      edit_profile: "प्रोफ़ाइल संपादित करें",
      languages: "भाषाएँ",
      dark_theme: "डार्क मोड",
      notifications: "सूचनाएं",
    },
    account: {
      title: "खाता और गोपनीयता",
      edit_password: "पासवर्ड बदलें",
    },
    about: {
      developer_options: "डेवलपर विकल्प",
      use_dev_api: "डेवलपर API का उपयोग करें",
      title: "के बारे में",
      guidelines: "समुदाय दिशानिर्देश",
      privacy_policy: "गोपनीयता नीति",
      feedback: "प्रतिक्रिया भेजें",
    },
    sign_out: "खाते से साइन आउट करें",
  },
  SendFeedback: {
    title: "प्रतिक्रिया भेजें",
    feedback_type: {
      bug: "बग",
      suggestion: "सुझाव",
      others: "अन्य",
    },
    labels: {
      message: "संदेश",
    },
    done: "भेजें",
    sent: "प्रतिक्रिया सफलतापूर्वक भेजी गई!",
  },
  Search: {
    header_title: "अन्वेषण करें",
    input_placeholder: "आज आप क्या खोज रहे हैं?",
    title: "फिलहाल कोई परिणाम नहीं",
    subtitle:
      "किसी समूह के नाम, संबंधित टैग या उपयोगकर्ता नाम से खोजने का प्रयास करें।",
    loading: {
      title: "खोज रहा है...",
      subtitle: "इसमें थोड़ा समय लग सकता है",
    },
    participants_one: "प्रतिभागी",
    participants_other: "प्रतिभागी",
    filters: {
      all: "सभी",
      users: "उपयोगकर्ता",
      groups: "समूह",
    },
  },
  InviteManager: {
    header_title: "आमंत्रण और अनुरोध",
    subtitle: "प्राप्त आमंत्रणों और मित्र अनुरोधों का प्रबंधन करें।",
    empty_text:
      "कोई समूह आमंत्रण या मित्र अनुरोध नहीं है। बाद में वापस आएं।",
    toasts: {
      invite_accept: "आमंत्रण स्वीकार किया गया!",
      invite_reject: "आमंत्रण अस्वीकार कर दिया गया :(",
      request_accept: "अनुरोध सफलतापूर्वक स्वीकार किया गया!",
      request_reject: "अनुरोध सफलतापूर्वक अस्वीकार किया गया",
    },
  },
  Profile: {
    friends: "मित्र",
    participating: "भाग ले रहे हैं",
  },
  EditProfile: {
    header_title: "प्रोफ़ाइल संपादित करें",
    switch_avatar: "अवतार बदलें",
    searching: "खोज रहा है...",
    errors: {
      "400": "उपयोगकर्ता नाम अपेक्षित मानकों के अनुरूप नहीं है",
      "404": "उपयोगकर्ता नाम प्रदान नहीं किया गया था",
      "1000": "उपयोगकर्ता नाम प्राप्त नहीं किया जा सका",
      unavailable: "उपयोगकर्ता नाम उपलब्ध नहीं है",
    },
    toasts: {
      updated: "प्रोफ़ाइल अपडेट की गई",
      update_avatar: "अवतार अपडेट हो रहा है...",
      updated_avatar: "अवतार अपडेट किया गया",
      photo_permission:
        "अपना अवतार बदलने के लिए हमें आपकी फ़ोटो तक पहुँचने की अनुमति चाहिए!",
    },
    labels: {
      nickname: "उपयोगकर्ता नाम",
      name: {
        label: "नाम",
        placeholder: "अधिकतम 100 वर्ण",
      },
      bio: {
        label: "बायो",
        placeholder: "अधिकतम 100 वर्ण",
      },
    },
    done: "पूर्ण",
  },
  SwitchLanguage: {
    header_title: "भाषाएँ",
    title: "समझें कि भाषाएँ कैसे काम करती हैं",
    subtitle:
      "ऐप की भाषा आपके डिवाइस की डिफ़ॉल्ट भाषा द्वारा निर्धारित की जाती है।\n\nइसे बदलने के लिए, बस अपने डिवाइस की सेटिंग में जाएं और भाषा बदलें; ऐप स्वचालित रूप से अपडेट हो जाएगा।",
  },
  SwitchPassword: {
    header_title: "अपना पासवर्ड बदलें",
    toasts: {
      updated_pass: "पासवर्ड सफलतापूर्वक बदला गया!",
      incorrect_pass: "वर्तमान पासवर्ड गलत है!",
      error_pass: "पासवर्ड बदलने में त्रुटि!",
    },
    labels: {
      current_password: "वर्तमान पासवर्ड",
      new_password: {
        label: "नया पासवर्ड",
        error: "पासवर्ड सुरक्षा मानकों को पूरा नहीं करता है",
        info: "आपके पासवर्ड में कम से कम 8 वर्ण होने चाहिए (कम से कम 1 बड़ा अक्षर सहित), कम से कम 1 संख्या और 1 प्रतीक होना चाहिए।",
      },
      confirm_pass: {
        label: "नए पासवर्ड की पुष्टि करें",
        error: "पासवर्ड मेल نہیں खाते",
      },
    },
    done: "पासवर्ड बदलें",
  },
  Premium: {
    header_title: "तारामंडल का हिस्सा बनें!",
    be_star: "एक स्टार बनें!",
    title:
      "अपनी जेब के अनुकूल कीमत पर Saturn Chat पर अद्भुत लाभ और सुविधाएँ प्राप्त करें!",
    subtitle:
      "सभी उपलब्ध सुविधाओं का पूरा लाभ उठाएं जैसे बड़ी फ़ाइलें भेजना, अधिक समूह बनाना, सभी परेशान करने वाले विज्ञापन हटाना और बहुत कुछ!",
    free_month: "अभी सदस्यता लें और 1 महीना मुफ़्त पाएं!",
    buy_button: "{{price}} से प्राप्त करें",
    vantages_title: "स्टार प्लान के लाभ:",
    advantages: {
      0: "परेशान करने वाले विज्ञापनों से पूरी तरह मुक्त!",
      1: "फ़ाइल भेजने की जगह को {{multiple}}x बढ़ाएं: {{default}} MB से अविश्वसनीय {{premium}} MB तक।",
      2: "आपके द्वारा बनाए जाने वाले समूहों की संख्या बढ़ाएं: {{default}} से {{premium}} समूह।",
      3: "अपने समूहों में होने वाले प्रतिभागियों की संख्या बढ़ाएं: {{default}} से {{premium}} प्रतिभागी।",
      4: "दिखाने के लिए अपने नाम के बगल में एक विशेष बैッジ प्राप्त करें!",
      5: "लंबी बातें भेजना पसंद है? अपने संदेशों को {{default}} वर्णों से बढ़ाकर अद्भुत {{premium}} वर्ण करें!",
      6: "ऐप के विकास का समर्थन करें और त्वरित तरीके से कई नई सुविधाएँ लाने में मदद करें ❤",
      7: "CSV प्रारूप में अपने समूहों के संदेश निर्यात करें।",
    },
  },
  ManagePremium: {
    header_title: "स्टार प्लान प्रबंधित करें",
    alerts: {
      cancel_plan: {
        title: "❗ क्या आपको वाकई यकीन है?",
        content:
          "सदस्यता रद्द करने पर आप प्लान द्वारा दिए गए सभी लाभ खो देंगे। इसके अलावा, आपको पहले से भुगतान किए गए महीने का रिफंड नहीं मिलेगा (लेकिन आप नवीनीकरण तिथि तक लाभों का उपयोग कर सकते हैं)।",
        ok_text: "प्लान बनाए रखें",
        cancel_text: "प्लान रद्द करें",
      },
    },
    title: "अपने स्टार प्लान का प्रबंधन करें",
    subtitle:
      "यहाँ आप अपने प्लान के बारे में विवरण देख सकते हैं जैसे नवीनीकरण तिथि, भुगतान की स्थिति। आप यहाँ से किसी भी समय अपनी सदस्यता रद्द भी कर सकते हैं।",
    plan_labels: {
      plan: "सदस्यता प्लान:",
      status: "सदस्यता की स्थिति",
      start: "खरीद की तारीख",
      expire: "नवीनीकरण की तारीख",
      resume: "वापसी की तारीख",
    },
    payments: {
      0: "लंबित",
      1: "भुगतान किया गया",
      2: "परीक्षण",
      3: "प्लान अपडेट किया गया",
    },
    periods: {
      0: "मासिक",
      1: "त्रैमासिक",
      2: "वार्षिक",
    },
    cancel_text: "सदस्यता रद्द करें",
  },
  ChoosePlan: {
    header_title: "अपना प्लान चुनें",
    title: "हम लगभग पहुँच चुके हैं!",
    subtitle:
      "अब आपको चुनना होगा कि आप कौन सा प्लान चाहते हैं, आप मासिक, त्रैमासिक या वार्षिक प्लान में से चुन सकते हैं।",
    monthly: "मासिक",
    quarterly: "त्रैमासिक",
    yearly: "वार्षिक",
    button_text: "मुझे यह चाहिए!",
    finished: {
      success_title: "सदस्यता सफलतापूर्वक पूरी हुई!",
      error_title: "आपकी सदस्यता संसाधित नहीं की जा सकी",
      success_subtitle:
        "अब आप स्टार प्लान में उपलब्ध विभिन्न लाभों का आनंद ले सकते हैं! लेकिन ध्यान दें, सभी लाभों को पूरी तरह से अनलॉक होने में कुछ मिनट लग सकते हैं, इसलिए चिंता न करें।",
      error_subtitle:
        "आपका भुगतान अस्वीकार किया जा सकता है या ऐप स्टोर द्वारा आपकी खरीद रद्द कर दी गई हो सकती है। जांच करें और बाद में पुनः प्रयास करें",
    },
  },
  Chat: {
    alerts: {
      file_size: {
        title: "😱 यह बहुत भारी है!",
        content:
          "मैं इतनी भारी चीज़ लोड नहीं कर सकता, {{amount}} MB तक की फ़ाइल का प्रयास करें!",
        extra_button_text: "स्टार प्लान प्राप्त करें",
      },
      same_file: {
        title: "🤔 मैंने इसे पहले देखा है",
        content: "आपने भेजने के लिए यह फ़ाइल पहले ही चुन ली है!",
      },
      mic_perm: {
        title: "🙂 कृपया",
        content:
          "मुझे अपने माइक्रोफ़ोन का उपयोग करने की अनुमति चाहिए, ताकि मैं ऑडियो रिकॉर्ड कर सकूँ",
      },
    },
    toasts: {
      sending_voice: "वॉयस संदेश भेजा जा रहा है...",
    },
    type_message: "अपना संदेश लिखें...",
    drop_send: "भेजने के लिए छोड़ें",
    sent: "भेजा गया",
    limit_char: "{{count}} वर्णों की सीमा तक पहुँच गए!",
    no_send_message:
      " आप इस समूह में संदेश नहीं भेज सकते, लेकिन आप उन्हें देख सकते हैं और सूचनाएं प्राप्त कर सकते हैं।",
  },
  GroupConfig: {
    header_group_title: "समूह विकल्प",
    header_chat_title: "चैट विकल्प",
    alerts: {
      delete_group: {
        title: "⚠ सावधानी, यह खतरनाक है!",
        content:
          'यह क्रिया पूर्ववत नहीं की जा सकती! "{{name}}" समूह को हटाने पर आप सभी संदेश, फ़ाइलें और इस समूह में रखी गई अन्य चीज़ें भी हटा देंगे!',
        ok_text: "हटाएं",
        cancel_text: "रद्द करें",
      },
      exit_group: {
        title: "😥 क्या आप वाकई जाना चाहते हैं?",
        content:
          "समूह छोड़ने पर आपके संदेश सुरक्षित रखे जाएंगे, हालांकि, आपको नए संदेशों की सूचना नहीं मिलेगी और समूह में दोबारा प्रवेश करने के लिए आमंत्रित किया जाना होगा (यदि यह निजी है)!",
        ok_text: "बाहर निकलें",
      },
    },
    options: {
      general: {
        title: "सामान्य",
        participants: "प्रतिभागी",
        invite_users: "उपयोगकर्ताओं को आमंत्रित करें",
        edit_group: "समूह संपादित करें",
        details: "विवरण देखें",
        notify_new_participants:
          "नए प्रतिभागियों के समूह में शामिल होने पर समूह के मालिक को सूचित करें",
        accepting_new_users: "नए प्रतिभागियों का प्रवेश स्वीकार करें",
        max_participants:
          "प्रतिभागियों की अधिकतम संख्या (असीमित संख्या के लिए 0 पर छोड़ें)",
        minimum_role_for_send_message:
          "समूह में संदेश भेजने के लिए न्यूनतम पद (चयनित पद से ऊपर के पद समूह में संदेश नहीं भेज सकेंगे)",
        roles: {
          participant: "प्रतिभागी",
          moderator: "मॉडरेटर",
          manager: "प्रबंधक",
          admin: "प्रशासक",
        },
      },
      participant: {
        send_notifications: "नए संदेशों की सूचनाएं प्राप्त करें",
        title: "प्रतिभागी सेटिंग्स",
      },
      danger_zone: {
        title: "खतरे का क्षेत्र",
        delete_group: "समूह हटाएं",
        exit_group: "समूह छोड़ें",
      },
    },
    toasts: {
      submit_success: "सेटिंग्स सफलतापूर्वक बदली गईं",
      submit_error: "परिवर्तन सहेजे नहीं जा सके",
    },
  },
  Participants: {
    header_title_one: "{{count}} प्रतिभागी",
    header_title_other: "{{count}} प्रतिभागी",
    title: "सभी प्रतिभागी",
    created: "{{date}} को बनाया गया",
    joined: "{{date}} को शामिल हुए",
    online: "ऑनलाइन",
    last_seen: "{{date}} को अंतिम बार देखा गया",
    owner: "मालिक",
  },
  Participant: {
    title: "प्रतिभागी विकल्प",
    view_profile: "प्रोफ़ाइल देखें",
    change_role: "पद बदलें",
    kick: "निकालें",
    ban: "प्रतिभागी को प्रतिबंधित करें",
  },
  PunishParticipant: {
    title: "क्या आपको वाकई यकीन है?",
    desc_kick:
      'आप "{{groupName}}" समूह से "{{userName}}" प्रतिभागी को बाहर निकालने वाले हैं। क्या आपको अपनी पसंद पर यकीन है?',
    desc_ban:
      'आप "{{groupName}}" समूह से "{{userName}}" प्रतिभागी को प्रतिबंधित करने वाले हैं। क्या आपको अपनी पसंद पर यकीन है?',
    notify_text: "प्रतिभागी को सज़ा की सूचना दें",
    confirm_text_kick: "हाँ, अभी निकालें!",
    confirm_text_ban: "हाँ, अभी प्रतिबंधित करें!",
    cancel_text: "नहीं, मैंने अपना मन बदल लिया",
    toasts: {
      success: "उपयोगकर्ता को सफलतापूर्वक दंडित किया गया!",
      error: "उपयोगकर्ता को दंडित नहीं किया जा सका। पुनः प्रयास करें।",
    },
  },
  ChangeRole: {
    header_title: "पद बदलें",
    title: "पद",
    subtitle:
      "विशेष पदों वाले सदस्यों का विभिन्न संसाधनों (जैसे पद और आमंत्रण प्रबंधन, समूह संपादन आदि) पर नियंत्रण हो सकता है। जिन लोगों पर आप भरोसा करते हैं उन्हें महत्वपूर्ण पद दें।",
    roles: {
      participant: {
        name: "प्रतिभागी",
        desc: "यह पद प्रतिभागी को कोई विशेष अधिकार नहीं देता है।",
      },
      mod: {
        name: "मॉडरेटर",
        desc: "मॉडरेटर वे होते हैं जो समूह की सुरक्षा का ध्यान रखते हैं।",
      },
      manager: {
        name: "प्रबंधक",
        desc: "प्रबंधक समूह को प्रबंधित करने और नए उपयोगकर्ताओं को लाने में मदद करते हैं।",
      },
      admin: {
        name: "प्रशासक",
        desc: "प्रतिभागी को समूह के मालिक के समान अधिकार रखने की अनुमति देता है।",
      },
    },
    permissions: {
      create_invites: "नए उपयोगकर्ताओं को आमंत्रित करने के लिए आमंत्रण बनाएं",
      punish_members: "उद्दंड प्रतिभागियों को दंडित करें",
      manage_roles: "पदों का प्रबंधन करें",
      manage_messages: "संदेशों का प्रबंधन करें (जैसे उन्हें हटाना)",
      edit_group: "समूह की जानकारी संपादित करें (नाम, अवतार, विवरण)",
      delete_group: "समूह हटाएं",
    },
    toasts: {
      success: "उपयोगकर्ता का पद सफलतापूर्वक बदल दिया गया",
      error: "पद बदलने में त्रुटि। पुनः प्रयास करें।",
    },
  },
  FriendsManager: {
    alerts: {
      unfriend: {
        title: "⚠️ मित्रता समाप्त करना चाहते हैं?",
        content:
          "यदि आप इस उपयोगकर्ता को मित्रों की सूची से हटाते हैं, तो आप इस उपयोगकर्ता से सीधे संदेश भेज और प्राप्त नहीं कर पाएंगे। आपके बीच के सभी संदेश दोनों के लिए हटा दिए जाएंगे।",
        ok_text: "मित्रता समाप्त करें",
      },
    },
    header_title: "मित्रों का प्रबंधन करें",
  },
  InviteUsers: {
    header_title: "आमंत्रित करें",
    empty_title:
      "आमंत्रित करने के लिए कोई मित्र नहीं है। लिंक के माध्यम से आमंत्रण साझा करने का प्रयास करें।",
    title: "समूह आमंत्रण",
    subtitle:
      "हमारे आमंत्रण प्रबंधक के माध्यम से समूह के सभी आमंत्रण बनाएं और प्रबंधित करें",
    new_invite_text: "आमंत्रण प्रबंधित करें",
    friends_invite_title: "अपने मित्रों को आमंत्रित करें",
    friends_invite_subtitle:
      "केवल वे मित्र जो समूह में नहीं हैं, यहाँ दिखाई देते हैं। शामिल होने के लिए उन्हें आमंत्रण स्वीकार करना होगा।",
    invite: "आमंत्रित करें",
    invited: "आमंत्रित किया गया",
    toasts: {
      success: "आमंत्रण सफलतापूर्वक भेजा गया!",
      error: "आपके मित्र को आमंत्रित नहीं किया जा सका!",
    },
  },
  NewInvites: {
    header_title: "आमंत्रण बनाएं",
    title: "आमंत्रण उत्पन्न करें",
    subtitle: "आप इन सेटिंग्स के साथ आमंत्रण उत्पन्न कर सकते हैं:",
    permanent: "स्थाई आमंत्रण",
    usage_unlimited: "असीमित उपयोग",
    usage_one: "अधिकतम {{count}} बार उपयोग करें",
    usage_other: "अधिकतम {{count}} बार उपयोग करें",
    expire_one: "{{count}} दिन में समाप्त",
    expire_other: "{{count}} दिनों में समाप्त",
    day_one: "दिन",
    day_other: "दिन",
    active_invites: "सक्रिय आमंत्रण",
    generate: "उत्पन्न करें",
    expire_in: "में समाप्त ",
    usage_amount_one: "का {{count}} बार उपयोग किया गया ",
    usage_amount_other: "का {{count}} बार उपयोग किया गया ",
    toasts: {
      error_create: "आमंत्रण नहीं बनाया जा सका।",
      success_create: "आमंत्रण सफलतापूर्वक बनाया गया!",
      error_remove: "आमंत्रण हटाया नहीं जा सका।",
      success_remove: "आमंत्रण सफलतापूर्वक हटाया गया!",
      copy_invite: "आमंत्रण कॉपी किया गया!",
    },
  },
  EditGroup: {
    toasts: {
      success: "समूह सफलतापूर्वक संपादित किया गया!",
      avatar_permission: "हमें आपकी फ़ोटो तक पहुँचने की अनुमति चाहिए!",
      updating: "अवतार अपडेट हो रहा है...",
      updated: "अवतार अपडेट किया गया",
    },
    header_title: "समूह संपादित करें",
    switch_avatar: "अवतार बदलें",
    inputs: {
      name: "नाम",
      desc: "विवरण",
      public: "सार्वजनिक करें",
    },
    done: "पूर्ण",
  },
  GroupInfos: {
    join: "शामिल हों",
    joined: "शामिल हैं",
    participants_one: "प्रतिभागी",
    participants_other: "प्रतिभागी",
    tags: "समूह टैग",
    desc: "विवरण",
    no_desc: "इस समूह का कोई विवरण नहीं है।",
    no_tags: "कोई टैग परिभाषित नहीं है",
    accepting_participants_text:
      "यह समूह प्रतिभागियों की अधिकतम संख्या तक पहुँच गया है",
    toasts: {
      error: "समूह में शामिल होना संभव नहीं था!",
    },
  },
  Report: {
    header_title: "रिपोर्ट करें",
    title: "अपनी रिपोर्ट दर्ज करें",
    subtitle:
      "कुछ ऐसा मिला जो सही नहीं लगता? अपनी रिपोर्ट दर्ज करें ताकि हम स्थिति का विश्लेषण कर सकें और उचित उपाय कर सकें। चिंता न करें, आपकी रिपोर्ट पूरी तरह से गोपनीय है।",
    types: {
      SPAM: "स्पैम और/या अवांछित संदेश",
      VIOLENCE: "हिंसक प्रथाएं, आत्महत्या के लिए उकसाना या आग्नेयास्त्रों का प्रदर्शन",
      SEXUAL: "यौन सामग्री, बाल पोर्नोग्राफी या नाबालिगों का शोषण",
      BULLYING: "बुलिंग या उपयोगकर्ताओं के प्रति अनादर",
      RACISM: "घृणास्पद भाषण, नस्लवाद, ज़ेनोफ़ोबिया और इसी तरह के अन्य",
      SCAM: "धोखाधड़ी, नकली लॉटरी, जबरन वसूली और इसी तरह के अन्य",
      FAKE_ACCOUNT: "नकली सामग्री या किसी व्यक्ति के रूप में बहुरूपिया बनने का प्रयास",
      DMCA: "कॉपीराइट सुरक्षित सामग्री",
      OTHER: "अन्य",
    },
    done: "रिपोर्ट करें",
    sent: "रिपोर्ट सफलतापूर्वक दर्ज की गई",
  },
};